# Начало рута Евы

define smile = False

label eve:

    if persistent.ending1 and persistent.ending122:
        scene bg_rut
    else:
        scene bg_rut

    "Эта девушка всегда училась с нами?"
    
    jump eva_ch1


label eva_ch1:

    $ save_name = _("Глава 1. Ева")

    "Какая необычная у этой девушки внешность. Загадочная, я бы сказал."

    "Густые и чёрные, словно смоль, волосы, заплетённые в две объемных косы. Яркий, фиолетовый костюм, что заметен издали. Значок на груди и лёгкая бледность. Всё это - отличительные черты соседки по парте."

    "И вроде бы ничего экстраординарного в моей новой одногруппнице нет, но именно эта девушка почему-то вызвала во мне двоякие чувства. Я вижу её впервые, но ощущение, словно мы уже где-то встречались - только где?"

    "Почему я вообще задумываюсь о подобном?"

    "Я пока совсем не знаю ни институт, ни одногруппников, ни преподавателей, а мозг уже захламили странные и непонятные мысли. В первую очередь мне нужно показать себя с хорошей стороны и произвести приятное впечатление."

    "Ладно, думаю мне стоит сначала познакомиться с ней, а со странными мыслями разберусь позже."

    show mc normal crossed at left2 with dissolve

    mc "Привет. Могу ли я сесть рядом? Ты первая, кто привлёк моё внимание."

    show eva_ghost_normal at right2 with dissolve

    hide mc normal crossed at left2
    show mc sad crossed at left2

    "Блин, зачем я сказал последнее? Я же совсем другое имел в виду!"

    "Несмотря на неловкость в первые секунды, таинственная незнакомка улыбнулась и кивнула мне в ответ. "

    hide eva_ghost_normal at right2
    show eva_ghost_smile at right2
    
    "Значит, всё не так уж и плохо. Но почему тогда я до сих пор чувствую себя странно?"

    "Я сел на свободное место рядом, а ощущения никуда не ушли. Напротив, нахлынули с новой интенсивностью… Почему я сейчас испытываю такое сильное чувство дежавю?"

    "Улыбка…У меня мурашки по коже идут."

    "В ней нет ничего тёплого, живого. Словно натянутая на лицо маска - да такая искусная, что с первого взгляда совсем не отталкивает. Эта девушка что-то запредельное, притягивает к себе даже сквозь холод."

    menu:
        "Улыбнуться в ответ":
            ##$ relate_eva += 5
            $ smile = True
            
            hide mc sad crossed at left2
            show mc smile crossed at left2

            "Я улыбнулся в ответ. Вроде бы обычное дело — человеку улыбнуться, когда он тебе улыбается. "
            hide eva_ghost_normal at right2
            show eva_ghost_smile at right2
            "Но почему-то внутри всё сжалось. Не от страха, нет. Скорее от какой-то странной неловкости, будто что-то не так.."

            play sound ghost_giggle 

            "От её хихиканья мне стало и немного теплее, и в то же время ещё более неловко. Как будто между нами есть что-то, чего я не понимаю, а она — понимает"

            e "А ты забавный. Как тебя зовут?"
            mc "Меня [mcname]. А тебя?"

            "Я выдохнул, подготавливаясь к стандартному диалогу."

            e "А меня нет."
            
            play sound ghost_giggle 

            "Она рассмеялась, а я сидел и хлопал глазами, чувствуя себя полным идиотом. В смысле 'меня нет'? Как нет? А как тогда я вижу её???"

            "Ну и шуточки. Наверное, по моему лицу заметно, что я впал в ступор. Совсем не ожидал такого ответа в начале знакомства.."

            "В голове промелькнула паническая мысль: может, пересесть? Пока не поздно, пока я не увяз в этом разговоре ещё глубже. Найду какое-нибудь свободное место подальше от этой странной девушки."

            e "Да успокойся ты. Шуток не понимаешь, что ли? Какой-то ты скучный."
            e "Ева меня зовут. Приятно познакомиться, [mcname]."
            mc "Приятно познакомиться, Ева."

            "Ева. Хорошее имя. Может и не стоит пересаживаться. Просто она... любит пошутить, видимо."

            "И всё равно неловко. Сижу тут как дурак, повёлся на глупую уловку... Она наверное думает, что я вообще тупой. Или что я зануда и со мной даже пошутить нельзя."
            "А может и правда со мной что-то не так? Ну кто так реагирует на обычную шутку? Надо попроще быть."

            "Я слегка огляделся. Может, спросить что-то про одногруппников? Хороший шанс сменить тему и узнать про новый коллектив."



        "Протянуть руку":
            "Я немного помедлил, но всё же решил протянуть руку для приветствия. В конце концов, это просто вежливо"

            mc "Привет, я [mcname]."

            "Но вместо ответного жеста Ева буквально отпрянула от меня. Девушка дёрнулась так резко и таким взглядом посмотрела на меня, будто я сделал что-то ужасно неприятное. Я опешил и не сразу понял, что произошло."
            "К тому же моя рука не выглядела грязной, потной или неухоженной. Вроде бы всё нормально..."
            "Может быть, ей просто неприятен телесный контакт с малознакомыми людьми? Некоторые девушки действительно этого не любят, особенно при первой встрече. "
            "Обычно парни при знакомстве пожимают руки, но здесь ситуация другая. Наверное, стоило просто представиться."
            "Я почувствовал, что одним неудачным жестом испортил первое впечатление о себе. И ведь не хотел ничего плохого… Просто не знал, что это ей покажется неприятным."
            "Надежда на то, что мы сможем нормально пообщаться, начала таять, и я уже приготовился к неловкому молчанию, но…"

            e "Я — Ева."

            "Её голос прервал мои туманные размышления. Я с надеждой поднял глаза — Ева выглядела спокойной, хотя какое-то внутреннее чувство подсказывало, что обида на тот неловкий жест осталась."
            "Но, мне показалось, что она пыталась не зацикливаться на этой ситуации."
            "Я просто кивнул, потому что побоялся снова сделать или сказать что-то не то. Хотя бы так — не усугублять. А затем решил не упускать появившуюся возможность перевести разговор на другую тему."

            mc "Может, расскажешь мне о моих новых одногруппниках? Мне интересно, с кем я проведу оставшиеся студенческие годы буду учиться бок о бок."


            



    



